In [50]:
import pandas as pd
df = pd.read_csv("data_clean.csv")

In [3]:
df

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

### Handling missing values

#### Check for missing data:

In [5]:
df.isnull() # returns boolean values for each column

    Name    Age   City  Gender  Email  Join Date
0  False  False  False   False  False      False
1  False   True  False   False  False      False
2  False  False  False   False  False      False
3  False   True  False   False  False      False
4  False  False  False   False  False      False
5   True  False  False   False  False       True
6  False  False  False   False  False      False
7  False  False  False   False  False      False
8  False   True  False   False  False      False

In [7]:
df.isnull().sum() # returns no. of missing values in each column

Name         1
Age          3
City         0
Gender       0
Email        0
Join Date    1
dtype: int64

#### Drop missing values:

In [24]:
df.dropna() # drop rows with any missing value. To alter original df: df = df.dropna().

    Name   Age         City Gender              Email   Join Date
0  Alice  25.0     New York      F  alice@example.com  01-05-2021
2    Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4  David  22.0       Mumbai      M  david@example.com  12-11-2019
6  Alice  25.0     New York      F  alice@example.com  01-05-2021
7  Alice  25.0     New York      F  alice@example.com  01-05-2021

In [18]:
df.dropna(axis = 1) # drop columns with missing values. To alter original df: df = df.dropna(axis = 1)

          City Gender              Email
0     New York      F  alice@example.com
1        Delhi      M    charlie@example
2  Los Angeles      M    bob@example.com
3        Delhi      M    charlie@example
4       Mumbai      M  david@example.com
5        Delhi      F     eve@domain.com
6     New York      F  alice@example.com
7     New York      F  alice@example.com
8        Delhi      M    charlie@example

#### Fill missing values:

In [26]:
df.fillna(0) # replace all missing values with 0. To alter original df: df = df.fillna(0)

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie   0.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5        0  28.0        Delhi      F     eve@domain.com           0
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   0.0        Delhi      M    charlie@example  20-07-2021

In [27]:
df["Age"].fillna(df["Age"].mean()) # replace all missing values in column "Age" with its mean. 
# To alter original df["Age"]: df["Age"] = df["Age"].fillna(df["Age"].mean())

0    25.000000
1    25.833333
2    30.000000
3    25.833333
4    22.000000
5    28.000000
6    25.000000
7    25.000000
8    25.833333
Name: Age, dtype: float64

In [34]:
df.ffill() # Replaces the missing value with last row's value. Counting starts from top.
# To alter original df: df = df.ffill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  25.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    David  28.0        Delhi      F     eve@domain.com  12-11-2019
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie  25.0        Delhi      M    charlie@example  20-07-2021

In [35]:
df.bfill() # Replace missing value from last row's value. Counting starts from bottom. 
# Here, the 8th row doesn't have any change since it doesn't have any rows after it.
# To alter original df: df = df.bfill()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie  30.0        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie  22.0        Delhi      M    charlie@example  20-07-2021
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5    Alice  28.0        Delhi      F     eve@domain.com  01-05-2021
6    Alice  25.0     New York      F  alice@example.com  01-05-2021
7    Alice  25.0     New York      F  alice@example.com  01-05-2021
8  Charlie   NaN        Delhi      M    charlie@example  20-07-2021

### Detecting & Removing Duplicates

#### Check for duplicate values:

In [33]:
df.duplicated() # checks for any duplicate rows and returns boolean values

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [36]:
df.drop_duplicates() # drops duplicate rows. To alter original df: df = df.drop_duplicates()

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

#### For columns:

In [39]:
df.duplicated(subset=['Name',"City"]) # check based on specific columns

0    False
1    False
2    False
3     True
4    False
5    False
6     True
7     True
8     True
dtype: bool

In [40]:
df.drop_duplicates(subset=["Name","City"]) # drop based on specific columns

      Name   Age         City Gender              Email   Join Date
0    Alice  25.0     New York      F  alice@example.com  01-05-2021
1  Charlie   NaN        Delhi      M    charlie@example  20-07-2021
2      Bob  30.0  Los Angeles      M    bob@example.com  15-06-2020
4    David  22.0       Mumbai      M  david@example.com  12-11-2019
5      NaN  28.0        Delhi      F     eve@domain.com         NaN

### String Operations with .str
Works like vectorized string methods and returns a pandas Series. Works only for columns with string values. We can apply python's string methods. However, it doesn't support all string methods.

In [43]:
df["Name"].str.lower()

0      alice
1    charlie
2        bob
3    charlie
4      david
5        NaN
6      alice
7      alice
8    charlie
Name: Name, dtype: object

In [44]:
df["City"].str.contains("Delhi", case=False) # checks for "delhi" value. It is case insensitive because of case = False

0    False
1     True
2    False
3     True
4    False
5     True
6    False
7    False
8     True
Name: City, dtype: bool

In [46]:
df["Email"].str.split("@") # splits the values into a list on the argument. It is a python list.

0    [alice, example.com]
1      [charlie, example]
2      [bob, example.com]
3      [charlie, example]
4    [david, example.com]
5       [eve, domain.com]
6    [alice, example.com]
7    [alice, example.com]
8      [charlie, example]
Name: Email, dtype: object

### Type Conversions with .astype()

In [51]:
df2 = df.fillna(0).copy()

In [52]:
df2["Age"] = df2["Age"].astype(int)
df2

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie    0        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie    0        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5        0   28        Delhi      F     eve@domain.com           0
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie    0        Delhi      M    charlie@example  20-07-2021

We will use pd.to_datetime() for data time values. It is special because of the below features:

In [56]:
df2.iloc[5,5] = '12-11-2019'

In [57]:
df2

      Name  Age         City Gender              Email   Join Date
0    Alice   25     New York      F  alice@example.com  01-05-2021
1  Charlie    0        Delhi      M    charlie@example  20-07-2021
2      Bob   30  Los Angeles      M    bob@example.com  15-06-2020
3  Charlie    0        Delhi      M    charlie@example  20-07-2021
4    David   22       Mumbai      M  david@example.com  12-11-2019
5        0   28        Delhi      F     eve@domain.com  12-11-2019
6    Alice   25     New York      F  alice@example.com  01-05-2021
7    Alice   25     New York      F  alice@example.com  01-05-2021
8  Charlie    0        Delhi      M    charlie@example  20-07-2021

In [60]:
df2["Join Date"] = pd.to_datetime(df2["Join Date"],format='mixed') # It handles the format itself.
df2

      Name  Age         City Gender              Email  Join Date
0    Alice   25     New York      F  alice@example.com 2021-01-05
1  Charlie    0        Delhi      M    charlie@example 2021-07-20
2      Bob   30  Los Angeles      M    bob@example.com 2020-06-15
3  Charlie    0        Delhi      M    charlie@example 2021-07-20
4    David   22       Mumbai      M  david@example.com 2019-12-11
5        0   28        Delhi      F     eve@domain.com 2019-12-11
6    Alice   25     New York      F  alice@example.com 2021-01-05
7    Alice   25     New York      F  alice@example.com 2021-01-05
8  Charlie    0        Delhi      M    charlie@example 2021-07-20

Check data types:

In [61]:
df2.dtypes

Name                 object
Age                   int64
City                 object
Gender               object
Email                object
Join Date    datetime64[ns]
dtype: object

### Applying Functions

1. .apply(): applies a function to all of the values

In [62]:
df2['Country'] = df2["City"].apply(lambda x: "USA" if (x=="Los Angeles") or (x=="New York") else "India")

In [63]:
df2

      Name  Age         City Gender              Email  Join Date Country
0    Alice   25     New York      F  alice@example.com 2021-01-05     USA
1  Charlie    0        Delhi      M    charlie@example 2021-07-20   India
2      Bob   30  Los Angeles      M    bob@example.com 2020-06-15     USA
3  Charlie    0        Delhi      M    charlie@example 2021-07-20   India
4    David   22       Mumbai      M  david@example.com 2019-12-11   India
5        0   28        Delhi      F     eve@domain.com 2019-12-11   India
6    Alice   25     New York      F  alice@example.com 2021-01-05     USA
7    Alice   25     New York      F  alice@example.com 2021-01-05     USA
8  Charlie    0        Delhi      M    charlie@example 2021-07-20   India

2. .map(): replaces the elements with dict values if they match with dict keys. If values don't match, it replaces them with NaN.

In [64]:
df2["Gender"] = df["Gender"].map({"M": "Male", "F": "Female", "O": "Others"})

In [65]:
df2

      Name  Age         City  Gender              Email  Join Date Country
0    Alice   25     New York  Female  alice@example.com 2021-01-05     USA
1  Charlie    0        Delhi    Male    charlie@example 2021-07-20   India
2      Bob   30  Los Angeles    Male    bob@example.com 2020-06-15     USA
3  Charlie    0        Delhi    Male    charlie@example 2021-07-20   India
4    David   22       Mumbai    Male  david@example.com 2019-12-11   India
5        0   28        Delhi  Female     eve@domain.com 2019-12-11   India
6    Alice   25     New York  Female  alice@example.com 2021-01-05     USA
7    Alice   25     New York  Female  alice@example.com 2021-01-05     USA
8  Charlie    0        Delhi    Male    charlie@example 2021-07-20   India

3. .replace(): works just like .map() but doesn't replace values with NaN.

In [66]:
df2["Continent"] = df2["Country"].replace({"USA": "North America", "India": "Asia"})
df2

      Name  Age         City  ...  Join Date Country      Continent
0    Alice   25     New York  ... 2021-01-05     USA  North America
1  Charlie    0        Delhi  ... 2021-07-20   India           Asia
2      Bob   30  Los Angeles  ... 2020-06-15     USA  North America
3  Charlie    0        Delhi  ... 2021-07-20   India           Asia
4    David   22       Mumbai  ... 2019-12-11   India           Asia
5        0   28        Delhi  ... 2019-12-11   India           Asia
6    Alice   25     New York  ... 2021-01-05     USA  North America
7    Alice   25     New York  ... 2021-01-05     USA  North America
8  Charlie    0        Delhi  ... 2021-07-20   India           Asia

[9 rows x 8 columns]